summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_regdef.h
/** \\brief  Memory Interface Offset Counter Init Value For Main Picture Cb
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_OFFS_CNT_INIT:22;    /**< \brief [23:2] Main Picture Cb Offset Counter Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits;

/** \\brief  Memory Interface Current Offset Counter Of Main Picture Cb
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_OFFS_CNT:22;     /**< \brief [23:2] Main Picture Cb Offset Counter (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD_Bits;

/** \\brief  Memory Interface Offset Counter Start Value For Main Picture Cb
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_OFFS_CNT_START:22;   /**< \brief [23:2] Main Picture Cb Offset Count Start (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_OFFS_CNT_START_Bits;

/** \\brief  Memory Interface Size Of Main Picture Cb Component Ring Buffer
 * Register */
typedef struct _Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_SIZE_INIT:22;    /**< \brief [23:2] Main Picture Cb Size Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits;

/** \\brief  Memory Interface Size Shadow Register Of Main Picture Cb Component
 * Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CB_SIZE:22;         /**< \brief [23:2] Main Picture Cb Size (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CB_SIZE_SHD_Bits;

/** \\brief  Memory Interface Base Address For Main Picture Cr Component Ring
 * Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_BASE_AD_INIT:30; /**< \brief [31:2] Main Picture Cr Base Address Init (rw) */
} Ifx_CIF_MI_MP_CR_BASE_AD_INIT_Bits;

/** \\brief  Memory Interface Base Address Shadow Register For Main Picture Cr
 * Component Ring Register */
typedef struct _Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_BASE_AD:30;      /**< \brief [31:2] Main Picture Cr Base Address (r) */
} Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits;

/** \\brief  Memory Interface Offset Counter Init value For Main Picture Cr
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_OFFS_CNT_INIT:22;    /**< \brief [23:2] Main Picture Cr Offset Counter Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT_Bits;

/** \\brief  Memory Interface Current Offset Counter Of Main Picture Cr
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_OFFS_CNT:22;     /**< \brief [23:2] Main Picture Cr Offset Counter (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits;

/** \\brief  Memory Interface Offset Counter Start Value For Main Picture Cr
 * Component Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_OFFS_CNT_START:22;   /**< \brief [23:2] Main Picture Cr Offset Counter Start (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_OFFS_CNT_START_Bits;

/** \\brief  Memory Interface Size Of Main Picture Cr Component Ring Buffer
 * Register */
typedef struct _Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_SIZE_INIT:22;    /**< \brief [23:2] Main Picture Cr Size Init (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_SIZE_INIT_Bits;

/** \\brief  Memory Interface Size Shadow Register Of Main Picture Cr Component
 * Ring Buffer Register */
typedef struct _Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_CR_SIZE:22;         /**< \brief [23:2] Main Picture Cr Size (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits;

/** \\brief  Memory Interface Base Address For Main Picture Y Component, JPEG or
 * RAW Data Register */
typedef struct _Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;         /**< \brief [1:0] Bits [1:0] are set to "00" (word aligned value). (r) */
    Ifx_Strict_32Bit MP_Y_BASE_AD_INIT:30;  /**< \brief [31:2] Main Picture Y Base Address Init (rw) */
} Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits;

