summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_regdef.h
/** \\brief  ISP Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ERR_Bits B;
} Ifx_CIF_ISP_ERR;

/** \\brief  ISP Error Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ERR_CLR_Bits B;
} Ifx_CIF_ISP_ERR_CLR;

/** \\brief  ISP Shadow Flags Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_FLAGS_SHD_Bits B;
} Ifx_CIF_ISP_FLAGS_SHD;

/** \\brief  ISP Frame Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_FRAME_COUNT_Bits B;
} Ifx_CIF_ISP_FRAME_COUNT;

/** \\brief  ISP Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ICR_Bits B;
} Ifx_CIF_ISP_ICR;

/** \\brief  ISP Interrupt Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_IMSC_Bits B;
} Ifx_CIF_ISP_IMSC;

/** \\brief  ISP Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_ISR_Bits B;
} Ifx_CIF_ISP_ISR;

/** \\brief  ISP Masked Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_MIS_Bits B;
} Ifx_CIF_ISP_MIS;

/** \\brief  ISP Output Window Horizontal Offset Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_H_OFFS_Bits B;
} Ifx_CIF_ISP_OUT_H_OFFS;

/** \\brief  ISP Output Window Horizontal Offset Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits B;
} Ifx_CIF_ISP_OUT_H_OFFS_SHD;

/** \\brief  ISP Output Horizontal Picture Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_H_SIZE_Bits B;
} Ifx_CIF_ISP_OUT_H_SIZE;

/** \\brief  ISP Output Horizontal Picture Size Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits B;
} Ifx_CIF_ISP_OUT_H_SIZE_SHD;

/** \\brief  ISP Output Window Vertical Offset Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_V_OFFS_Bits B;
} Ifx_CIF_ISP_OUT_V_OFFS;

/** \\brief  ISP Output Window Vertical Offset Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits B;
} Ifx_CIF_ISP_OUT_V_OFFS_SHD;

/** \\brief  ISP Output Vertical Picture Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_V_SIZE_Bits B;
} Ifx_CIF_ISP_OUT_V_SIZE;

/** \\brief  ISP Output Vertical Picture Size Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits B;
} Ifx_CIF_ISP_OUT_V_SIZE_SHD;

/** \\brief  ISP Raw Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISP_RIS_Bits B;
} Ifx_CIF_ISP_RIS;

/** \\brief  ISP Image Stabilization Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_CTRL_Bits B;
} Ifx_CIF_ISPIS_CTRL;

/** \\brief  ISP Image Stabilization Camera Displacement Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_DISPLACE_Bits B;
} Ifx_CIF_ISPIS_DISPLACE;

/** \\brief  ISP Image Stabilization Horizontal Offset Of Output Window Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_H_OFFS_Bits B;
} Ifx_CIF_ISPIS_H_OFFS;

/** \\brief  SP Image Current Horizontal Offset Of Output Window Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_H_OFFS_SHD_Bits B;
} Ifx_CIF_ISPIS_H_OFFS_SHD;

/** \\brief  ISP Image Stabilization Output Horizontal Picture Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_H_SIZE_Bits B;
} Ifx_CIF_ISPIS_H_SIZE;

/** \\brief  ISP Image Current Output Horizontal Picture Size Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_H_SIZE_SHD_Bits B;
} Ifx_CIF_ISPIS_H_SIZE_SHD;

/** \\brief  ISP Image Stabilization Maximum Horizontal Displacement Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_MAX_DX_Bits B;
} Ifx_CIF_ISPIS_MAX_DX;

