summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCif_regdef.h
/** \\brief  ISP Image Stabilization Maximum Vertical Displacement Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_MAX_DY_Bits B;
} Ifx_CIF_ISPIS_MAX_DY;

/** \\brief  ISP Image Stabilization Recenter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_RECENTER_Bits B;
} Ifx_CIF_ISPIS_RECENTER;

/** \\brief  ISP Image Stabilization Vertical Offset Of Output Window Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_V_OFFS_Bits B;
} Ifx_CIF_ISPIS_V_OFFS;

/** \\brief  ISP Image Current Vertical Offset Of Output Window Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_V_OFFS_SHD_Bits B;
} Ifx_CIF_ISPIS_V_OFFS_SHD;

/** \\brief  ISP Image Stabilization Output Vertical Picture Size Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_V_SIZE_Bits B;
} Ifx_CIF_ISPIS_V_SIZE;

/** \\brief  ISP Image Current Output Vertical Picture Size Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_ISPIS_V_SIZE_SHD_Bits B;
} Ifx_CIF_ISPIS_V_SIZE_SHD;

/** \\brief  JPE Huffman Table Selector For AC Values Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_AC_TABLE_SELECT_Bits B;
} Ifx_CIF_JPE_AC_TABLE_SELECT;

/** \\brief  JPE Cb/Cr Value Scaling Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_CBCR_SCALE_EN_Bits B;
} Ifx_CIF_JPE_CBCR_SCALE_EN;

/** \\brief  JPE Huffman Table Selector For DC Values Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_DC_TABLE_SELECT_Bits B;
} Ifx_CIF_JPE_DC_TABLE_SELECT;

/** \\brief  JPE Debug Information Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_DEBUG_Bits B;
} Ifx_CIF_JPE_DEBUG;

/** \\brief  JPEG Codec Horizontal Image Size For Encoding Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ENC_HSIZE_Bits B;
} Ifx_CIF_JPE_ENC_HSIZE;

/** \\brief  JPEG Codec Vertical Image Size For Encoding Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ENC_VSIZE_Bits B;
} Ifx_CIF_JPE_ENC_VSIZE;

/** \\brief  JPE Start Command To Start JFIF Stream Encoding Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ENCODE_Bits B;
} Ifx_CIF_JPE_ENCODE;

/** \\brief  JPE Encode Mode Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ENCODE_MODE_Bits B;
} Ifx_CIF_JPE_ENCODE_MODE;

/** \\brief  JPE Encoder Status Flag Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ENCODER_BUSY_Bits B;
} Ifx_CIF_JPE_ENCODER_BUSY;

/** \\brief  JPE Error Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ERROR_ICR_Bits B;
} Ifx_CIF_JPE_ERROR_ICR;

/** \\brief  JPE Error Interrupt Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ERROR_IMR_Bits B;
} Ifx_CIF_JPE_ERROR_IMR;

/** \\brief  JPE Error Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ERROR_ISR_Bits B;
} Ifx_CIF_JPE_ERROR_ISR;

/** \\brief  JPE Error Masked Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ERROR_MIS_Bits B;
} Ifx_CIF_JPE_ERROR_MIS;

/** \\brief  JPE Error Raw Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_ERROR_RIS_Bits B;
} Ifx_CIF_JPE_ERROR_RIS;

/** \\brief  JPE Command To Start Stream Header Generation Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_GEN_HEADER_Bits B;
} Ifx_CIF_JPE_GEN_HEADER;

/** \\brief  JPE Header Mode Definition Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_HEADER_MODE_Bits B;
} Ifx_CIF_JPE_HEADER_MODE;

/** \\brief  JPE Automatic Configuration Update Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_JPE_INIT_Bits B;
} Ifx_CIF_JPE_INIT;

